[
  {
    "title": "Unleashing the Power of CSS",
    "url": "https://www.smashingmagazine.com/2023/01/level-up-css-skills-has-selector/",
    "source": "sitepoint",
    "description": "In this premium SitePoint series, we'll review CSS enhancements to layout, responsive design, element styling, properties, and selectors, and also peek at upcoming features; deep-dive into using the CSS :has() selector for scaling reusable components; discover the practical uses of container queries; and learn how to create responsive CSS layouts without using media queries."
  },
  {
    "title": "Level Up Your CSS Skills With The :has() Selector",
    "url": "https://www.smashingmagazine.com/2023/01/level-up-css-skills-has-selector/",
    "source": "smashingmag",
    "description": "The CSS relational selector :has() allows selecting elements in combinations that were previously impossible without the assistance of JavaScript. Review how to combine :has() with core CSS selectors to extend their capabilities."
  },
  {
    "title": "Getting Started With CSS Cascade Layers",
    "url": "https://www.smashingmagazine.com/2022/01/introduction-css-cascade-layers/",
    "source": "smashingmag",
    "description": "Within 2021, a new spec to orchestrate the “C” in CSS was drafted and is now an official candidate recommendation: cascade layers. Learn more about layers and how to use them."
  },
  {
    "title": "A Primer On CSS Container Queries",
    "url": "https://www.smashingmagazine.com/2021/05/complete-guide-css-container-queries/",
    "source": "smashingmag",
    "description": "Look at what problem is being solved, learn how container queries work, and see how they compare with and complement existing CSS features for layout."
  },
  {
    "title": "Contextual Spacing For Intrinsic Web Design",
    "url": "https://moderncss.dev/contextual-spacing-for-intrinsic-web-design/",
    "source": "moderncss",
    "description": "Learn how to coexist with the unpredictability of the browser by using adaptive, contextual spacing techniques. We'll construct a starter set of custom properties for gap, margin, and padding."
  },
  {
    "title": "CSS Scroll Snap Slide Deck That Supports Live Coding",
    "url": "https://css-tricks.com/css-scroll-snap-slide-deck/",
    "source": "csstricks",
    "description": "With a bit of creativity using native web functionality and modern CSS, like CSS scroll snap, we’ll be building a no-JavaScript slide deck that allows live editing of CSS demos."
  },
  {
    "title": "A Guide to CSS Debugging",
    "url": "https://www.smashingmagazine.com/2021/10/guide-debugging-css/",
    "source": "smashingmag",
    "description": "Debugging in CSS means figuring out what might be the problem when you have unexpected layout results. We’ll look at a few categories bugs often fit into, see how we can evaluate the situation, and explore techniques that help prevent these bugs."
  },
  {
    "title": "A Guide To Newly Supported, Modern CSS Pseudo-Class Selectors",
    "url": "https://www.smashingmagazine.com/2021/04/guide-supported-modern-css-pseudo-class-selectors/",
    "source": "smashingmag",
    "description": "This guide will cover CSS Level 4 pseudo-class selectors that currently have the best support along with examples to demonstrate how you can start using them today."
  },
  {
    "title": "A Community-Driven Site with Eleventy: Building the Site",
    "url": "https://css-tricks.com/a-community-driven-site-with-eleventy-building-the-site/",
    "source": "csstricks",
    "description": "Develop an Eleventy setup that you can use as a starting point for your own community (or personal) site."
  },
  {
    "title": "Guide to Advanced CSS Selectors - Part One",
    "url": "https://moderncss.dev/guide-to-advanced-css-selectors-part-one/",
    "source": "moderncss",
    "description": "Understanding selectors, the cascade, and specificity are critical to developing CSS and modifying existing style rules. This two-part guide about advanced CSS selectors includes practical examples."
  },
  {
    "title": "Custom Select Styles with Pure CSS",
    "url": "https://moderncss.dev/custom-select-styles-with-pure-css/",
    "source": "moderncss",
    "description": "Modern CSS gives us a range of properties to achieve custom select styles that have a near-identical initial appearance for single, multiple, and disabled `select` elements across the top browsers."
  },
  {
    "title": "Going Beyond Static Sites With Eleventy",
    "url": "https://11ty.rocks/posts/going-beyond-static-with-eleventy/",
    "source": "11tyrocks",
    "description": "Eleventy includes features that allow exceeding the traditional limits of static. Learn how to leverage these features and think beyond static when using Eleventy."
  },
  {
    "title": "How I Built and Launched A Small Web App in 17 Hours",
    "url": "https://dev.to/5t3ph/how-i-built-and-launched-a-small-web-app-in-17-hours-1cc0",
    "source": "dev",
    "description": "This reflection post reviews the tech stack used, reveals a few tricks, and provides some techniques for how to rapidly go from idea to launch for small projects."
  }
]
