[
  {
    "title": "A Guide to CSS Debugging",
    "url": "https://www.smashingmagazine.com/2021/10/guide-debugging-css/",
    "source": "smashingmag",
    "description": "Debugging in CSS means figuring out what might be the problem when you have unexpected layout results. We’ll look at a few categories bugs often fit into, see how we can evaluate the situation, and explore techniques that help prevent these bugs."
  },
  {
    "title": "A Primer On CSS Container Queries",
    "url": "https://www.smashingmagazine.com/2021/05/complete-guide-css-container-queries/",
    "source": "smashingmag",
    "description": "Look at what problem is being solved, learn how container queries work, and see how they compare with and complement existing CSS features for layout."
  },
  {
    "title": "A Guide To Newly Supported, Modern CSS Pseudo-Class Selectors",
    "url": "https://www.smashingmagazine.com/2021/04/guide-supported-modern-css-pseudo-class-selectors/",
    "source": "smashingmag",
    "description": "This guide will cover CSS Level 4 pseudo-class selectors that currently have the best support along with examples to demonstrate how you can start using them today."
  },
  {
    "title": "Create Responsive Image Effects With CSS Gradients And aspect-ratio",
    "url": "https://www.smashingmagazine.com/2021/02/responsive-image-effects-css-gradients-aspect-ratio/",
    "source": "smashingmag",
    "description": "A classic problem in CSS is maintaining the aspect ratio of images across related components, such as cards. Learn how to solve this with modern CSS!"
  },
  {
    "title": "A Community-Driven Site with Eleventy: Building the Site",
    "url": "https://css-tricks.com/a-community-driven-site-with-eleventy-building-the-site/",
    "source": "csstricks",
    "description": "Develop an Eleventy setup that you can use as a starting point for your own community (or personal) site."
  },
  {
    "title": "Guide to Advanced CSS Selectors - Part One",
    "url": "https://moderncss.dev/guide-to-advanced-css-selectors-part-one/",
    "source": "moderncss",
    "description": "Understanding selectors, the cascade, and specificity are critical to developing CSS and modifying existing style rules. This two-part guide about advanced CSS selectors includes practical examples."
  },
  {
    "title": "Custom Select Styles with Pure CSS",
    "url": "https://moderncss.dev/custom-select-styles-with-pure-css/",
    "source": "moderncss",
    "description": "Modern CSS gives us a range of properties to achieve custom select styles that have a near-identical initial appearance for single, multiple, and disabled `select` elements across the top browsers."
  },
  {
    "title": "Going Beyond Static Sites With Eleventy",
    "url": "https://11ty.rocks/posts/going-beyond-static-with-eleventy/",
    "source": "11tyrocks",
    "description": "Eleventy includes features that allow exceeding the traditional limits of static. Learn how to leverage these features and think beyond static when using Eleventy."
  },
  {
    "title": "How I Built and Launched A Small Web App in 17 Hours",
    "url": "https://dev.to/5t3ph/how-i-built-and-launched-a-small-web-app-in-17-hours-1cc0",
    "source": "dev",
    "description": "This reflection post reviews the tech stack used, reveals a few tricks, and provides some techniques for how to rapidly go from idea to launch for small projects."
  }
]
